
DELETE FROM public.products_inventory;

INSERT INTO public.products_inventory (product_id, size, color, quantity, reserved) VALUES
-- Рашгарды (XS-S, M-L)
('9-black','XS-S','Чёрный',40,0),('9-black','M-L','Чёрный',40,0),
('9-brown','XS-S','Шоколад',40,0),('9-brown','M-L','Шоколад',40,0),
('9-ivory','XS-S','Айвори',40,0),('9-ivory','M-L','Айвори',40,0),
-- Леггинсы
('13-black','XS-S','Чёрный',40,0),('13-black','M-L','Чёрный',40,0),
('13-blue','XS-S','Голубой',40,0),('13-blue','M-L','Голубой',40,0),
('14','XS-S','Шоколад',40,0),('14','M-L','Шоколад',40,0),
('15','XS-S','Айвори',40,0),('15','M-L','Айвори',40,0),
-- Топы
('10-black','XS-S','Чёрный',40,0),('10-black','M-L','Чёрный',40,0),
('10-blue','XS-S','Голубой',40,0),('10-blue','M-L','Голубой',40,0),
('11','XS-S','Шоколад',40,0),('11','M-L','Шоколад',40,0),
-- Майки
('12-black','XS-S','Чёрный',40,0),('12-black','M-L','Чёрный',40,0),
('12-ivory','XS-S','Айвори',40,0),('12-ivory','M-L','Айвори',40,0),
-- Сумки (ONE SIZE)
('16-blue','ONE SIZE','Голубой',40,0),
('16-black','ONE SIZE','Чёрный',40,0),
-- Лонгсливы (ONE SIZE)
('17','ONE SIZE','Айвори',40,0),
('18','ONE SIZE','Айвори',40,0);
